Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: ཡེ་ཤེས་ཀྱིས་རྗེས་སུ་བསྐོར་ཅིང་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། སངས་རྒྱས་རྣམས་ཀྱི་རྗེས་སུ་སློབ་པ་དང་། མཁས་པ་རྣམས་ཀྱིས་མ་སྨད་པ་དང་། དམ་བཅས་པ་ལས་མི་གཡོ་བ་དང་། ནན་ཏན་ལ་གནས་པ་དང་འཁོར་བ་ལས་འབྱོར་པ་དང་མྱ་ངན་ལས་འདས་པ་ཐོབ་པར་བྱེད་པ་དང་ཀུན་ནས་ལྡང་བ་མེད་པར་གནས་པ་དང་ཏིང་ངེ་འཛིན་རབ་ཏུ་འཐོབ་པ་དང་། མི་དབུལ་བར་འགྱུར་ཏེ།
en: they maintain their practice; [6] they turn away from saṃsāra; [7] they are led to attain nirvāṇa; [8] they live without faults arising; [9] they attain samādhi; and [10] they will never be poor.

source: གཞོན་ནུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའི་ཕན་ཡོན་ནོ།
en: “Young man, those are the ten benefits for the bodhisattva mahāsattvas who have perfectly pure, correct conduct.”

source: ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་བྱེད་ཅིང་།
en: “They bring wisdom to perfection,

source: །སངས་རྒྱས་དག་གི་རྗེས་སུ་སློབ།
en: Follow the example of the buddhas,

source: །མཁས་པ་དག་གིས་མ་སྨད་པ།
en: Do not criticize those who are wise,

source: །རྟག་ཏུ་འཇིགས་པ་མེད་པར་འགྱུར།
en: And they are always without fear. {1}

source: །དམ་བཅས་པ་ལས་མི་གཡོ་ཞིང་།
en: “They do not waver from their vows,

source: །ནན་ཏན་ལ་ཡང་རབ་ཏུ་གནས།
en: They maintain their practice,

source: །མྱ་ངན་འདས་པ་ཐོབ་བྱེད་ཅིང་།
en: They are led to attain nirvāṇa,

source: །འཁོར་བ་ལས་ཀྱང་ཤིན་ཏུ་འབྱོར།
en: And they turn away from saṃsāra. {2}

source: །ཀུན་ནས་ལྡང་བ་མེད་གནས་ཤིང་།
en: “They live without faults arising,

source: །ཏིང་ངེ་འཛིན་རྣམས་མྱུར་དུ་འཐོབ།
en: They quickly attain samādhi,

source: །དབུལ་པོར་ཡང་ནི་མི་འགྱུར་ཏེ།
en: They will not be poor,

source: །ཚུལ་ཁྲིམས་ཕུང་པོར་རབ་ཏུ་གནས།
en: And they maintain correct conduct. {3}

source: །དེ་ཡི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་འགྱུར།
en: “Their wisdom will be perfected,

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་རྗེས་སུ་སློབ།
en: And they follow the example of the buddhas. They never make criticisms of the wise,

source: །དེ་ལྟར་དེ་ཡི་ཚུལ་ཁྲིམས་ཡོངས་དག་ཅིང་།
en: And thus their conduct is completely pure. {4}

source: །དེ་ལ་མཁས་པ་དག་ནི་སྨོད་མི་བྱེད། །དམ་བཅས་པ་ལས་མཁས་པ་མི་གཡོ་ཞིང་།
en: “The wise ones never waver from their vows.

source: །དེ་ལྟར་དཔའ་བོ་ནན་ཏན་གནས་པར་བྱེད།
en: The heroic ones maintain their practice.

source: །འཁོར་བའི་ཉེས་པ་མང་པོ་མཐོང་ནས་ནི།
en: Seeing the many faults of saṃsāra

source: །འབྱོལ་ཞིང་མྱ་ངན་འདའ་བར་དེ་ཡིས་འགྲོ།
en: They go toward nirvāṇa. {5} “There are no faults that arise in their minds;

source: །དེ་ལྟར་ཚུལ་ཁྲིམས་སྟོབས་ལ་གནས་པས་ན། །དེ་ཡི་སེམས་ནི་ཀུན་ནས་ལྡང་མི་འགྱུར།
en: Thus, they maintain the strength of correct conduct,

source: །ཉོན་མོངས་མེད་པའི་ཏིང་འཛིན་མྱུར་དུ་འཐོབ།
en: And quickly attain an immaculate samādhi.

source: །ཚུལ་ཁྲིམས་དག་པའི་ཕན་ཡོན་འདི་དག་ཡིན།
en: Those are the benefits of pure, correct conduct.” {6}

source: །ཚུལ་ཁྲིམས་ངེས་པར་བསྟན་པའི་ལེའུ་སྟེ་ཉི་ཤུ་བརྒྱད་པའོ།། །།
en: Conclusion of the twenty-eighth chapter, “The Teaching on Correct Conduct.”

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པ་ལ་གནས་ཤིང་བྱམས་པ་ལ་སྤྱོད་པའི་ཕན་ཡོན་ནི་འདི་བཅུ་སྟེ།
en: Ten Benefits Chapter 29 “Young man, there are ten benefits for bodhisattva mahāsattvas from maintaining patience and being kind.

source: མེས་མི་ཚིག །མཚོན་གྱིས་མི་སོད།
en: they are not burned by fire; [2] they are not slain by weapons; [3]

source: དུག་གིས་མི་ཚུགས།
en: they are not affected by poison; [4]

source: ཆུས་མི་འཆི།
en: they do not drown in water; [5]

source: ལྷ་རྣམས་དེ་ལ་སྲུང་བར་བྱེད།
en: the devas protect them; [6]

source: ལུས་མཚན་གྱིས་བརྒྱན་པ་ཐོབ་པར་འགྱུར།
en: they attain a body adorned by the primary signs of a great being; [7]

source: དེའི་ངན་འགྲོའི་སྒོ་ཐམས་ཅད་བཅད་པར་འགྱུར།
en: all the doorways to their rebirth in lower existences are closed; [8]

source: དེ་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེ་བ་རྙེད་པ་མི་དཀའ་བར་འགྱུར།
en: it is not difficult for them to be reborn in the paradise of Brahmā; [9]

source: དེ་བདེ་བར་ཉིན་མཚན་འདའ་བར་འགྱུར།
en: they are happy day and night;

source: །དེའི་ལུས་ལ་དགའ་བ་དང་བདེ་བ་མི་འདོར་བར་འགྱུར་ཏེ།
en: and [10] their physical sensations of comfort and pleasure are never lost.

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པ་ལ་གནས་པ། བྱམས་པ་ལ་སྤྱོད་པའི་ཕན་ཡོན་ནི་འདི་བཅུའོ།
en: “Young man, those are the ten benefits for the bodhisattva mahāsattvas from maintaining patience and being kind.”

source: །དེ་ནི་མེས་ཀྱང་མི་ཚིག་སྟེ།
en: “They are not burned by fire,

source: །མཚོན་གྱིས་ཀྱང་ནི་སོད་མི་འགྱུར།
en: They are not killed by weapons,

source: །ལུས་ལ་དུག་གིས་མི་ཚུགས་ཏེ།
en: They are not affected by poison,

source: །ཆུས་ཀྱང་འཆི་བར་མི་འགྱུར་རོ།
en: They do not drown in water, {1}

source: །དེ་ལ་ལྷ་རྣམས་སྲུང་བྱེད་དེ།
en: “They are protected by devas,

source: །སུམ་ཅུ་རྩ་གཉིས་མཚན་ཀྱང་འབྱུང་།
en: They have the thirty-two primary signs,

source: །དེ་ཡི་ངན་འགྲོ་ཀུན་བཀག་སྟེ།
en: And the lower existences are closed to them.

source: །བཟོད་ལ་གནས་པའི་ཕན་ཡོན་འདི། །ཚངས་པ་དང་ནི་བརྒྱ་བྱིན་ཡང་།
en: Those are the benefits of patience. {2} “The state of Brahmā and the state of Śakra

source: །དེ་ལ་རྙེད་པར་དཀའ་མི་འགྱུར།
en: Are not difficult for them to attain.

source: །རྟག་ཏུ་བདེ་བར་གནས་བྱེད་ཅིང་།
en: They always dwell in happiness

source: །དགའ་བ་དག་ཀྱང་བསམ་ཡས་འགྱུར།
en: And have inconceivable pleasure. {3}

source: །དེ་ནི་མེ་དང་མཚོན་གྱིས་ཡོང་མི་སོད།
en: “They are not slain by fire or weapons;

source: །བྱེ་བྲག་ཏུ་ནི་ཆུ་ནང་མི་འཆི་སྟེ།
en: They are not killed by poison or drowning.

source: །ལྷ་དང་དེ་བཞིན་ཀླུ་དང་གནོད་སྦྱིན་སྲུང་།
en: They are protected by devas, nāgas, and yakṣas.

source: །བྱམས་ལ་གནས་པའི་ཕན་ཡོན་འདི་དག་གོ།
en: Those are the benefits of maintaining kindness. {4}

source: །དེ་ཡི་ལུས་ལ་སུམ་ཅུ་གཉིས་མཚན་འབྱུང་།
en: “Their bodies will have the thirty-two primary signs.

source: །དེ་ནི་ཕྱིར་ཡང་ལོག་ལྟུང་འགྲོ་མི་འགྱུར།
en: They will not fall into the lower existences,

source: །ཤི་འཕོས་ནས་ནི་ཚངས་པའི་གནས་སུ་སྐྱེ།
en: And at death they will be reborn in the realm of Brahmā.

source: །བཟོད་ལ་གནས་པའི་ཕན་ཡོན་འདི་དག་གོ།
en: Those are the benefits of maintaining patience. {5}

source: །དེ་ནི་ཉིན་མཚན་དག་ཀྱང་བདེ་བར་འདའ།
en: “They have happiness day and night.

source: །ལུས་ནི་དགའ་བས་རྟག་ཏུ་ཁྱབ་པར་འགྱུར།
en: Their bodies will have pleasurable sensations.

source: །བཟོད་ཅིང་དེས་པའི་སྟོབས་ལ་དེ་གནས་པས།
en: They will have the power of patience and bliss.

source: །མཁས་པ་རྟག་ཏུ་དང་བའི་སེམས་སུ་འགྱུར།
en: Those wise ones will always have a tranquil mind. {6}

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་པའི་ཕན་ཡོན་ནི་འདི་བཅུ་སྟེ།
en: “Young man, there are ten benefits for bodhisattva mahāsattvas from taking up diligence.

source: བསྙེན་དཀའ་བར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱིས་ཡོངས་སུ་བཟུང་བ་འཐོབ་པ་དང་ལྷས་ཡོངས་སུ་གཟུང་བར་འགྱུར་བ་དང་། དེས་ཐོས་པའི་ཆོས་ཡོངས་སུ་མི་ཉམས་པ་དང་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་འཐོབ་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་རིགས་འཐོབ་པ་དང་ནད་ཉུང་བར་འགྱུར་བ་དང་དེའི་ཟས་རྣམས་ཀྱང་ཡང་དག་པར་བདེ་བར་འཇུ་བར་འགྱུར་བ་དང་། པད་མ་ལྟ་བུར་འགྱུར་ཞིང་མདའ་སྟེའུ་ཁམ་ལྟར་མི་འགྱུར་བ་སྟེ།
en: it is difficult to approach their level; [2] they attain the state of being cared for by the buddhas; [3] they will be cared for by the devas; [4] they maintain the Dharma they have received; [5] they obtain the Dharma they have not previously received; [6] they attain the lineage of samādhis; [7] they have few illnesses; [8]

source: གཞོན་ནུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་པའི་ཕན་ཡོན་ནོ།
en: they digest their food well; [9] they are like lotuses; and [10] they are not like pestles. “Young man, those are the ten benefits for the bodhisattva mahāsattvas from taking up diligence.”

source: བསྙེན་དཀའ་བར་ཡང་རྟག་ཏུ་འགྱུར།
en: “It is difficult to approach their level.

source: །དེ་ལ་ལེ་ལོ་ཡོད་མིན་ཏེ།
en: They are without idleness.

source: །ལྷ་རྣམས་ཀྱང་ནི་སྲུང་བར་བྱེད།
en: The devas protect them.

source: །སངས་རྒྱས་དག་ནི་མྱུར་དུ་མཐོང་། །སྨོན་ལམ་ཡོངས་སུ་རྫོགས་བྱེད་དེ།
en: They quickly see the buddhas. {7} “Their prayers are fulfilled,

source: །ཏིང་འཛིན་རིགས་ནི་རྙེད་པར་འགྱུར།
en: They attain the lineage of samādhis,

source: །དེ་ལ་ནད་ཀྱང་མི་འབྱུང་སྟེ།
en: And they do not become ill.

source: བརྩོན་འགྲུས་ལྡན་པའི་ཡོན་ཏན་འདི།
en: Those are the benefits of diligence. {8–9}

source: །དེ་ཡི་ཟས་དང་སྐོམ་དག་ཀྱང་། །བདེ་བར་འཇུ་སྟེ་རྨྱ་བ་མེད།
en: “They digest pleasurably, without harm, That which they eat and drink. {10}

source: །ཆུ་ཡི་ནང་ན་ཨུད་པལ་དག །རིམ་གྱིས་སྐྱེ་བར་འགྱུར་བ་ལྟར།
en: They gradually develop Like a blue lotus in the middle of water.

source: །དེ་བཞིན་བྱང་ཆུབ་སེམས་དཔའ་ཡང་།
en: “In that way the bodhisattvas

source: །དཀར་པོའི་ཆོས་ཀྱིས་རྣམ་པར་འཕེལ།
en: Develop through good qualities. {11}

source: །དེ་ཡི་ཉིན་དང་མཚན་མོ་ཡང་།
en: The days and the nights

source: །འབྲས་བུ་ཡོད་པར་འདའ་བར་འགྱུར།
en: Pass fruitfully for them.

source: །བརྩོན་འགྲུས་བརྩམ་པ་དེ་བཞིན་གཤེགས།
en: “The Tathāgata who has engaged in diligence,

source: །བསྐལ་པ་དུ་མར་བསྒྲུབས་པ་ཡིས།
en: Gaining accomplishments for numerous eons,

source: །བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ལྡན། །དེ་ཡི་ཕན་ཡོན་འདི་དག་བཤད།
en: Has taught to the bodhisattvas These benefits of possessing diligence. {12}

source: །དེས་པ་བརྩོན་འགྲུས་བརྩམས་འགྱུར་ཏེ།
en: “Those who engage in diligence

source: །རྒྱལ་བ་དག་གིས་ཡོངས་སུ་བཟུང་།
en: Are in the care of the jinas.

source: །ལྷ་ཡང་དེ་ལ་སྨོན་པ་སྐྱེད།
en: The devas, too, make aspirations for them.

source: །སངས་རྒྱས་བྱང་ཆུབ་མྱུར་འཚང་རྒྱ།
en: They will soon attain the Buddha’s enlightenment. {13}

source: །དེ་ཡི་ཐོས་པ་ཡང་མི་འབྲི།
en: “What they have learned will never diminish,

source: །ཆོས་གཞན་མང་པོ་སྨྲ་བར་བྱེད།
en: And they give many other Dharma teachings.

source: །དེ་ཡི་སྤོབས་པ་རྒྱ་ཆེར་འཕེལ།
en: Their confidence of speech increases immensely.

source: །བརྩོན་འགྲུས་བརྩམས་པའི་ཕན་ཡོན་འདི།
en: Those are the benefits of engaging in diligence. {14}

source: །ཏིང་འཛིན་རིགས་ཀྱང་མྱུར་དུ་འཐོབ།
en: “They will quickly attain the lineage of samādhis.

source: །དེ་ལ་ནམ་ཡང་ནད་མི་འབྱུང་།
en: They will never become ill.

source: །དེས་ནི་ཁ་ཟས་ཅི་ཟོས་པ།
en: Whatever food they eat

source: །བདེ་བར་ཡོངས་སུ་འཇུ་བར་འགྱུར།
en: They will comfortably digest completely. {15} “Day and night the good qualities

source: །མི་གཡེལ་བརྩོན་འགྲུས་བརྩམས་པ་ཡི། །དཀར་པོའི་ཕྱོགས་ནི་ཉིན་མཚན་འཕེལ།
en: Of their powerful diligence increase.

source: །དེ་ལྟར་བརྩོན་འགྲུས་སྟོབས་ལྡན་པས།
en: Through the power of this diligence,

source: །རིང་པོར་མི་ཐོགས་བྱང་ཆུབ་འགྱུར།
en: Before long they will attain enlightenment. {16}

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་ལ་མོས་པའི་ཕན་ཡོན་ནི་འདི་བཅུ་སྟེ། །བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Young man, there are ten benefits for bodhisattva mahāsattvas from being devoted to meditation. What are the ten benefits? They are: [1] they maintain their bodhisattva conduct; [2] they engage in the field of that conduct; [3] they live free from anguish; [4]

source: སྤྱོད་པ་ལ་གནས་པ་དང་སྤྱོད་ཡུལ་ལ་སྤྱོད་པ་དང་ཡོངས་སུ་གདུང་བ་མེད་པར་གནས་པ་དང་དབང་པོ་སྦས་པར་འགྱུར་བ་དང་། །དགའ་བ་མྱོང་བ་དང་འདོད་པ་ལས་དབེན་པ་དང་བསམ་གཏན་གསོག་གིས་ཚིམ་པ་མེད་པ་མ་ཡིན་པ་དང་བདུད་ཀྱི་ཡུལ་ལས་ཐར་བ་དང་སངས་རྒྱས་ཀྱི་ཡུལ་ལ་རབ་ཏུ་གནས་པ་དང་། རྣམ་པར་གྲོལ་བ་རབ་ཏུ་སྨིན་པར་བྱེད་པ་སྟེ།
en: their sensory faculties are protected; [5] they experience pleasure; [6] they are separated from desire; [7] they have insatiability for meditation; [8] they are free from the domain of Māra; [9] they are established in the domain of the Buddha; and [10] they ripen the state of liberation.

source: གཞོན་ནུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་ལ་མོས་པའི་ཕན་ཡོན་ནོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ། སྤྱོད་པ་དག་ལ་དེ་གནས་པས།
en: “Young man, those are the ten benefits for the bodhisattva mahāsattvas from being devoted to meditation.” On this topic, it was said:

source: །དེ་ནི་སྤྱོད་པ་མེད་མི་འགྱུར།
en: “They are never without bodhisattva conduct, As they are established in bodhisattva conduct.

source: །རྣལ་འབྱོར་པ་ནི་སྤྱོད་ཡུལ་སྤྱོད།
en: The yogins practice the field of that conduct,

source: །སྤྱོད་ཡུལ་མ་ཡིན་རྣམ་པར་སྤོང་།
en: And reject that which is not the field of that conduct. {17}

source: །གདུང་བ་མེད་པར་དེ་གནས་ཏེ།
en: “They live without anguish.

source: །དབང་པོ་བསྡམས་ཤིང་སྦས་པ་ཡིན།
en: Their senses hidden and bound,

source: །དེ་ནི་དགའ་བ་མྱོང་བྱེད་དེ།
en: They experience pleasure.

source: །བསམ་གཏན་སྒོམ་པའི་སྤྱོད་ཡུལ་ལོ།
en: Their field of conduct is practicing meditation. {18}

source: །འདོད་པའི་སྲེད་ལ་འདོད་ཆགས་བྲལ།
en: “They are without desire, or the craving of desire.

source: །བསམ་གཏན་བདེ་ལ་སྟེན་བྱེད་དེ།
en: They abide in the bliss of meditation.

source: །བདུད་ཀྱི་ཡུལ་ལས་དེ་ཐར་ཅིང་།
en: They are free from the domain of Māra

source: །སངས་རྒྱས་ཡུལ་ལ་དེ་གནས་སོ།
en: And dwell in the Buddha’s domain. {19}

source: །རྣལ་འབྱོར་བྱེ་བྲག་འདི་ཡིན་ཏེ།
en: “This is the particular quality of the yogins:

source: །གཅིག་པུ་ནགས་ཁྲོད་མོས་བྱེད་ཅིང་།
en: That they delight in being alone in the forest.

source: །རྣམ་པར་གྲོལ་བ་ཡོངས་སུ་སྐོང་།
en: They bring liberation to fruition.

source: །དེ་ནི་བཅུ་པའི་གནས་ཡིན་ནོ།
en: Those are the ten aspects. {20}

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སྤྱོད་ལ་གནས།
en: “The bodhisattvas remain in bodhisattva conduct

source: །སྤྱོད་པ་མ་ཡིན་ཐམས་ཅད་རྣམ་པར་སྤང་།
en: And they reject everything that is not that conduct.

source: །སྤྱོད་ཡུལ་མ་ཡིན་སྤངས་ནས་སྤྱོད་ཡུལ་གནས།
en: They reject that which is not the field of that conduct and remain in that which is.

source: །ཏིང་འཛིན་བརྩོན་པའི་ཕན་ཡོན་འདི་དག་གོ།
en: Those are the benefits of endeavoring in samādhi. {21}

source: །དེ་ལ་གདུང་བ་ནམ་ཡང་གདུང་མི་འགྱུར།
en: “They never experience anguish.

source: །འཕགས་པའི་བདེ་བར་གནས་པ་རེག་ནས་སུ།
en: They reach the state of higher bliss.

source: །ལུས་དང་སེམས་རྣམས་ཀྱང་ནི་བདེ་བར་འགྱུར།
en: Both their body and mind become blissful.

source: །བསམ་གཏན་བརྩོན་པའི་ཕན་ཡོན་འདི་དག་གོ།
en: These are the benefits of endeavoring in meditation. {22}

source: །དགོན་པའི་གནས་དག་ཏུ་ཡང་བསྲུངས་ཤིང་གནས།
en: “They live secretly in solitary places.

source: །དེ་ལ་གཡེང་བ་ནམ་ཡང་འབྱུང་མི་འགྱུར།
en: They never have any distractions.

source: །དེ་ལྟར་ལུས་ནི་དབེན་པར་གྱུར་པས་ན།
en: Thus their bodies are in isolation

source: །ཟང་ཟིང་མེད་པའི་དགའ་བ་དེར་འཐོབ་བོ།
en: And they attain happiness free of desires. {23}

source: །འདོད་པ་དག་གིས་མི་གོས་ཉོན་མོངས་མེད།
en: “They are unstained by desires and have no kleśas.

source: །དེ་ལྟར་བདུད་ཀྱི་ཡུལ་ལས་ཐར་བས་ན།
en: Thus they are free from the domain of Māra

source: །དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་རབ་གནས་ཏེ།
en: And are established in the domain of the tathāgatas.

source: །དེ་ཡི་རྣམ་གྲོལ་ཡོངས་སུ་སྨིན་པར་འགྱུར།
en: They bring their liberation to fruition. {24}

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་སྤྱོད་པའི་ཕན་ཡོན་ནི་འདི་བཅུ་སྟེ།
en: “Young man, there are ten benefits for bodhisattva mahāsattvas from engaging in wisdom.

source: བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་ལ་སྦྱིན་པས་དག་པར་རློམ་སེམས་མི་བྱེད་པ་ཡིན།
en: they give away all their possessions without becoming proud that they are pure; [2]

source: ཚུལ་ཁྲིམས་མ་དྲལ་ཅིང་ཚུལ་ཁྲིམས་ལ་མི་གནས་པ་ཡིན།
en: they have immaculate, correct conduct without forming an attachment to that conduct; [3]

source: བཟོད་པའི་སྟོབས་ལ་གནས་ལ་སེམས་ཅན་དུ་འདུ་ཤེས་པ་ལ་མི་གནས་པ་ཡིན།
en: they maintain the power of patience without maintaining the conceptualization that there are beings; [4]

source: བརྩོན་འགྲུས་བརྩམས་ལ་ལུས་དང་སེམས་དབེན་པ་ཡིན། བསམ་གཏན་ལ་བསམ་གཏན་དུ་བྱེད་ཅིང་མི་གནས་པའི་བསམ་གཏན་པ་ཡིན།
en: they take up diligence in isolation from body and mind; [5] in meditating they meditate with a non-abiding meditation; [6]

source: བདུད་རྣམས་ཀྱིས་ཐུབ་པར་དཀའ་བ་ཡིན།
en: they are invincible to the māras; [7]

source: ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་མི་སྒུལ་བ་ཡིན། འདུ་བྱེད་འཇུག་པ་ཐམས་ཅད་ལ་སྣང་བ་ཐོབ་པ་ཡིན། སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོ་རྒྱ་ཆེར་འཇུག་སྟེ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལ་རེ་བ་མེད་པ་ཡིན། སངས་རྒྱས་ཀྱི་བསམ་གཏན་དང་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ལ་རབ་ཏུ་འཇུག་པ་ཡིན་ཏེ།
en: they are unshakable to all adversaries; [8] they attain illumination regarding all engagement with the composite; [9] they engage in vast great compassion for all beings, and have no aspiration for the level of the śrāvakas or pratyekabuddhas; and [10] they enter into the dhyānas, samādhis, and samāpattis of the buddhas.

source: གཞོན་ནུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་སྤྱོད་པའི་ཕན་ཡོན་ནོ།
en: “Young man, those are the ten benefits for the bodhisattva mahāsattvas from engaging in wisdom.”

source: དཔའ་བོ་བདོག་པ་ཐམས་ཅད་གཏོང་།
en: “The heroic ones give away all their possessions

source: །དེས་ནི་དག་པར་རློམ་སེམས་མེད།
en: But do not become proud that they are pure.

source: །ཚུལ་ཁྲིམས་མ་དྲལ་སྲུང་མོད་ཀྱི།
en: They keep their correct conduct immaculate

source: །དེ་ལ་གནས་པར་བྱེད་པ་མེད།
en: But they form no attachment to that. {25}

source: །ཤེས་རབ་ཅན་དེ་བཟོད་སྒོམ་ཡང་།
en: “The wise ones meditate on patience

source: །སེམས་ཅན་འདུ་ཤེས་རྣམ་པར་ཟློག །བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་མོད་ཀྱི།
en: But have expelled the conceptualization of beings. They are those who engage in diligence

source: །ལུས་དང་སེམས་ནི་རྣམ་པར་དབེན།
en: But in isolation from body and mind. {26}

source: །བསམ་གཏན་ལ་ཡང་སྒོམ་མོད་ཀྱི།
en: “They are those who cultivate meditation,

source: །གནས་པ་མེད་ཅིང་རྟེན་པ་མེད།
en: But without abiding and independent;

source: །བདུད་ཀྱིས་ཐུབ་པར་དཀའ་བར་འགྱུར།
en: They are invincible to the māras.

source: །ཤེས་རབ་ལྡན་པའི་ཡོན་ཏན་འདི།
en: Those are the qualities of those who have wisdom. {27} “They are unshakable

source: །ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་ཀྱིས། །དེ་ནི་བསྐྱོད་པར་མི་ནུས་འགྱུར།
en: To every adversary

source: །འཁོར་བ་ན་ཡང་སྣང་བ་འཐོབ།
en: And have obtained the illumination of saṃsāra.

source: །ཤེས་རབ་ཡོན་ཏན་འདི་འདྲའོ།
en: Those are the qualities of wisdom. {28} “They have attained great compassion

source: །སེམས་ཅན་དག་ནི་ཐམས་ཅད་ལ། །དེ་ནི་སྙིང་རྗེ་ཆེ་བར་འགྱུར།
en: Toward all beings.

source: །ཉན་ཐོས་རང་རྒྱལ་ཡེ་ཤེས་ལ། །ནམ་ཡང་རེ་བ་སྐྱེད་མི་འགྱུར།
en: They never have an aspiration For the wisdom of the śrāvaka or pratyekabuddha. {29}

source: །བདོག་པ་ཐམས་ཅད་གཏོང་ཡང་རློམ་སེམས་མེད།
en: “They are not proud of being pure through giving away all their possessions.

source: །ཚུལ་ཁྲིམས་མ་དྲལ་ཚུལ་ཁྲིམས་མི་གནས་ཏེ།
en: They have immaculate correct conduct but have no attachment to conduct.

source: །བཟོད་པ་སྒོམ་ཡང་སེམས་ཅན་འདུ་ཤེས་མེད།
en: They meditate on patience but have no conceptualization of beings.

source: །ཤེས་རབ་མོས་པའི་ཕན་ཡོན་འདི་དག་གོ།
en: Those are the benefits of being devoted to wisdom. {30}

source: །བརྩོན་འགྲུས་བརྩམས་ཀྱང་རྣམ་པར་དབེན་པ་ཡིན།
en: “They engage in diligence but in isolation.

source: །མི་གནས་བསམ་གཏན་བྱེད་ཅིང་རྟེན་པ་མེད།
en: They meditate without being bound, without fixation.

source: །མཁས་པ་དེ་ནི་བདུད་ཀྱིས་ཐུབ་པར་དཀའ།
en: They are wise and are invincible to Māra.

source: །ཕ་རོལ་རྒོལ་བས་བསྐྱོད་པར་མི་འགྱུར་ཞིང་།
en: “They are unshakable to adversaries.

source: །དེས་ནི་འདུས་བྱས་འདི་ཡི་གཏིང་རྙེད་པས།
en: They have discovered the shallowness of the composite,

source: །སེམས་ཅན་དག་ལ་སྙིང་རྗེ་རྒྱ་ཆེར་སྐྱེད།
en: And they have vast compassion for beings.

source: །ཤེས་རབ་མོས་པའི་ཕན་ཡོན་འདི་དག་གོ། །དེ་ལྟར་སངས་རྒྱས་ཡོན་ཏན་དེ་གནས་པས།
en: Those are the benefits of being devoted to wisdom. {32} “They never give rise to an aspiration to be

source: །རང་རྒྱལ་རྣམས་དང་ཉན་ཐོས་རྣམས་ལ་ནི།
en: A pratyekabuddha or śrāvaka,

source: །དེ་དག་ནམ་ཡང་སྨོན་པ་མི་སྐྱེད་དེ།
en: And thus they are established in the qualities of a buddha.

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མང་དུ་ཐོས་པའི་ཕན་ཡོན་ནི་འདི་བཅུ་སྟེ། བཅུ་གང་ཞེ་ན།
en: “Young man, there are ten benefits for bodhisattva mahāsattvas from becoming very learned. What are the ten benefits? They are: [1] they do not create kleśas; [2] they do not develop malice; [3] they expose doubts; [4] they make views accurate; [5]

source: འདི་ལྟ་སྟེ།
en: they shun the wrong paths; [6]

source: ཀུན་ནས་ཉོན་མོངས་པར་མི་བྱེད་པ་དང་གནོད་སེམས་མི་སྐྱེད་པ་དང་ཐེ་ཚོམ་རྣམ་པར་འབྱེད་པ་དང་ལྟ་བ་དྲང་པོར་བྱེད་པ་དང་ལམ་ལོག་པ་སྤོང་བ་དང་ལམ་ལ་གནས་པ་དང་མི་འཆི་བའི་སྒོར་གནས་པ་དང་བྱང་ཆུབ་ཏུ་བསྙེན་པ་དང་སེམས་ཅན་ཐམས་ཅད་ལ་སྣང་བར་གྱུར་པ་དང་ངན་འགྲོ་ཐམས་ཅད་ཀྱིས་མི་འཇིགས་པ་སྟེ།
en: they are established on the true path; [7] they have reached the doorway to deathlessness; [8] they are close to enlightenment; [9] they are a light for beings; and [10] they have no fear of the lower existences.

source: གཞོན་ནུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མང་དུ་ཐོས་པའི་ཕན་ཡོན་ནོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: “Young man, those are the ten benefits for the bodhisattva mahāsattvas from becoming very learned.” On this topic, it was said: “These are taught to be the ten benefits From becoming very learned

source: ཡང་དག་ཇི་བཞིན་མཁྱེན་པ་ཡི།
en: Just as they are known

source: །སངས་རྒྱས་དེ་བཞིན་གཤེགས་པ་ཡིས། །མང་དུ་ཐོས་པའི་ཕན་ཡོན་ནི།
en: By the Tathāgata, the Buddha. {34}

source: །བཅུ་པོ་འདི་དག་རབ་ཏུ་བཤད།
en: “They know the two aspects

source: །ཉོན་མོངས་རྣམ་པར་བྱང་བ་ཡི། །ཕྱོགས་གཉིས་པོ་ནི་དེས་ཤེས་ཏེ།
en: Of the kleśas and of purification.

source: །ཀུན་ནས་ཉོན་མོངས་ཡོངས་སྤངས་ནས།
en: They reject the kleśas

source: །རྣམ་པར་བྱང་བའི་ལམ་ལ་སྟོན།
en: And follow the path of purification. {35}

source: །ནེམ་ནུར་རྣམ་འབྱེད་ཡེ་ཤེས་ལྡན།
en: “The wise ones reject doubts

source: །ལྟ་བ་དྲང་པོར་རབ་སྲོང་ཞིང་།
en: And develop accurate views.

source: །ལོག་པའི་ལམ་ཡང་རྣམ་སྤངས་ཏེ།
en: They shun the wrong path

source: །དྲང་པོའི་ལམ་ལ་གནས་པར་བྱེད།
en: And follow the correct path. {36}

source: །མི་འཆི་སྒོ་ལ་དེ་གནས་ཤིང་།
en: “They are at the door to deathlessness

source: །བྱང་ཆུབ་ཏུ་ཡང་ཉེ་བར་འགྱུར།
en: And they are close to enlightenment.

source: །སེམས་ཅན་ལ་ཡང་སྣང་འགྱུར་ཏེ།
en: They are a light for beings

source: །ངན་སོང་དག་ལ་འཇིགས་པ་མེད།
en: And they are not afraid of the lower existences. {37}

source: །ཀུན་ནས་ཉོན་མོངས་ཆོས་མང་རབ་ཤེས་ཤིང་།
en: “They know the numerous properties of having the kleśas,

source: །རྣམ་པར་བྱང་བའི་ཕྱོགས་ཀྱང་དེ་བཞིན་ཤེས།
en: And in the same way they know the aspect of purification.

source: །ཀུན་ནས་ཉོན་མོངས་ཡོངས་སུ་སྤངས་ནས་ནི།
en: They completely reject the kleśas

source: །རྣམ་པར་བྱང་བའི་ཆོས་ཀྱི་མཆོག་ལ་སློབ།
en: And train in the supreme quality of purification. {38}

source: །སྲོག་ཆགས་ཀུན་གྱི་ནེམ་ནུར་རྣམ་འབྱེད་ཅིང་།
en: “They expose the doubts of all beings.

source: །དེ་ཡི་ལྟ་བ་རྟག་ཏུ་དྲང་པོར་འགྱུར།
en: They have a view that is always accurate.

source: །དེ་ནི་ལོག་པའི་ལམ་ཡང་རྣམ་སྤངས་ཏེ།
en: They shun the wrong path

source: །ཞི་བ་དྲང་པོའི་ལམ་ལ་རྟག་ཏུ་གནས།
en: And are always upon the true path of peace. {39}

source: །མི་འཆི་ལམ་ལ་ཁོར་མོར་གནས་འགྱུར་ཞིང་།
en: “They are always beside the doorway to deathlessness;

source: །དྲི་མེད་བྱང་ཆུབ་ལ་ཡང་ཉེ་བར་འགྱུར།
en: They are always close to stainless enlightenment.

source: །སྲོག་ཆགས་མང་པོ་ཀུན་ལའང་སྣང་བར་འགྱུར།
en: They have become a light to all the multitudes of beings

source: །དེ་ནི་ངན་འགྲོ་དག་ལའང་འཇིགས་པ་མེད།
en: And they have no fear of the lower existences. {40}

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱི་སྦྱིན་པ་ལྷུར་བྱེད་པ། །གཞན་ལ་ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པའི་ཕན་ཡོན་ནི་འདི་བཅུ་སྟེ། བཅུ་གང་ཞེ་ན།
en: “Young man, for bodhisattva mahāsattvas who are intent on giving the Dharma, there are ten benefits that come from giving the Dharma. What are the ten benefits? They are: [1] they reject that which should not be done; [2] they engage in that which should be done; [3] they follow the Dharma of a worthy person; [4]

source: བྱ་བ་མ་ཡིན་པ་རྣམ་པར་སྤོང་བ་དང་། བྱ་བ་ལ་འཇུག་པ་དང་། སྐྱེས་བུ་དམ་པའི་ཆོས་ལ་གནས་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱོང་བ་དང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ཐོབ་པར་བྱེད་པ་དང་། དངོས་པོ་ཡོངས་སུ་གཏོང་བ་དང་ཉོན་མོངས་པ་ཚར་གཅོད་པ་དང་སེམས་ཅན་ཐམས་ཅད་ལ་སྐལ་བའི་ཤས་སྦྱིན་པ་དང་དེ་ལ་དམིགས་པའི་བྱམས་པ་སྒོམ་པ་དང་ཚེ་འདི་ལ་བདེ་བ་འཐོབ་པ་སྟེ།
en: they reach the Bodhimaṇḍa; [6] they give away material things; [7] they overcome the kleśas; [8] they give their portion to all beings; [9] they meditate on love toward those on whom their minds are focused;
